Repository: Richasy/Img-Share
Catalog: Img_Share/Language/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AddImageSuccess
source: Successfully add {count} pictures
zh_cn: 成功添加{count}张图片

# AddSuccessTitle
source: Successfully
zh_cn: 添加成功

# AuthErrorContent
source: Please re-authorize later. If you can't connect to OneDrive, the software will not be available.
zh_cn: 请稍后重新完成授权，若不能与OneDrive连接，软件将无法使用

# AuthErrorTitle
source: Authorization failure
zh_cn: 授权失败

# AuthKeyBox.PlaceholderText
source: Input key
zh_cn: 输入授权码

# AuthKeyEmpty
source: Authorization Key can't be empty!
zh_cn: 授权码不能为空！

# AuthKeyLinkTip.Content
source: Click Me!
zh_cn: 戳我戳我

# AuthKeyTip
source: Good! \nNow there's the last step. You need to enter your authorization key. If you are a little confused, please click the link below to view the tutorial (Chinese).
zh_cn: 好！\n现在还剩下最后一步，你需要输入您的授权密钥。如果您有点懵，请点击下面的链接查看教程

source: Authorize
zh_cn: 授权

# AuthorizeCancel
source: Although you cancelled the authorization code, you can still enter the software homepage. The next time you upload the picture, the software will remind you to enter the authorization code again.😀
zh_cn: 虽然您取消了授权码的填写，不过您依然可以进入软件主页，在下一次上传图片时，软件会再次提醒您输入授权码的哟~😀

# AuthorizeSuccess
source: Your key has been recorded\nIt will be embedded in the generated image link, you can also change your key in the software. \nOh! By the way!\nWelcome to use this software😀
zh_cn: 您的密钥已被记录，它将会嵌入到生成的图片链接中\n您也可以在软件里重新更改您的密钥\n哦！对了！\n欢迎您使用本软件😀

# AuthorizeTitle
source: AuthKey
zh_cn: 输入分享密钥

source: Cancel
zh_cn: 取消

# CreateDate
source: Date
zh_cn: 创建日期

# DefaultTipTitle
source: App Tip
zh_cn: 软件提示

# DefaultUploadInfoTitle
source: Upload Info
zh_cn: 上传信息

# GroupDialogTitle
source: Choose a Group
zh_cn: 选择一个组

# GroupManagerButton.Content
source: Group Manager
zh_cn: 分组管理

# HistoryTip.Text
source: History
zh_cn: 历史记录

# ImageCount
source: Upload Count
zh_cn: 上传数目

# ImageSize
source: Size
zh_cn: 图片大小

# ImageType
source: Type
zh_cn: 图片类型

# LastestTip.Text
source: Recently
zh_cn: 最近上传

# NetworkError1.Text
source: Oooops!
zh_cn: 出错了

# NetworkError2.Text
source: Network connection error, what happened
zh_cn: 连不上网，怎么办

# NoData.Text
source: Ooops! No Image!
zh_cn: 惨了，没有图片呢

source: None
zh_cn: 无

source: OK
zh_cn: 确认

source: R.P.
zh_cn: 分辨率

# StartLinkButton.Content
source: Start
zh_cn: 开始连接

# UploadAreaContent.Text
source: Files will be uploaded to your OneDrive application folder, and uploaded images will be displayed on the right. And automatically generate image links
zh_cn: 文件将会被上传至您的OneDrive应用文件夹内，已上传图片将在右侧显示。并会自动生成图片链接。右键或长按可选择从剪切板粘贴图片

# UploadAreaTitle.Text
source: Drop Image Here
zh_cn: 拖拽图片到这里

# WaittingTip
source: One moment please...
zh_cn: 请稍候，组件正在加载...

# WaitToUpload
source: Please wait patiently for the current list to be uploaded.
zh_cn: 请耐心等待当前列表上传完成

# Welcome1.Text
source: Welcome
zh_cn: 热烈欢迎

# Welcome2.Text
source: One~Drive~Link~🎵
zh_cn: 快来连接OneDrive呀！

# AddFailTitle
source: Failed
zh_cn: 添加失败

# AddImageFailed
source: Failure to add {count} pictures
zh_cn: 共有{count}张图片上传失败

# ImageInfoTitle.Text
source: Info
zh_cn: 图片信息

# FileName.Text
source: File Name
zh_cn: 文件名

# Link.Text
source: Link Address
zh_cn: 链接地址

# CloseButton.Content
source: Close
zh_cn: 关闭

# Copied
source: Already copied
zh_cn: 已复制

# NotExist
source: Picture Link Failed
zh_cn: 图片链接已失效

# CopyGroup.Text
source: Other Copy Options
zh_cn: 其它复制

# CopyToHTML
source: Copy to Img Tag
zh_cn: 复制为Img标签

# CopyToMarkdown
source: Copy to Markdown Link
zh_cn: 复制为Markdown链接

# SelectGroupTip.Text
source: Where are you going to put these pictures? Please choose
zh_cn: 你打算把这些图片放在哪里呢？请选择

# AddGroupSuccess
source: Add Groups Successfully!
zh_cn: 添加分组成功！

# AddGroupTip.Text
source: Add a group of pictures, note that the group name can not be repeated (ignore case)
zh_cn: 添加一个图片分组，注意，组名不能重复哦（忽视大小写）

# AddGroupTitle
source: Add Group
zh_cn: 添加分组

source: All Size
zh_cn: 总文件大小

# GroupName
source: Group
zh_cn: 组名

# GroupNameEmpty
source: Group name cannot be empty!
zh_cn: 组名不能为空！

source: Group name repeat!
zh_cn: 组名重复！

source: Delete
zh_cn: 删除

# DeleteGroupSuccess
source: Group has been deleted successfully
zh_cn: 组已经被成功删除

# DeleteGroupTip
source: You will delete this group, and the pictures in the group will also be affected. Are you sure you want to do this? If you want to change the position of the picture, please select - Transfer - After the transfer of the picture, the empty group will be deleted.
zh_cn: 您将删除这个组，组内的图片也会被波及，是否确定要这么做？\n如果您想给图片挪个窝，请选择 -转移图片- 图片转移后，将删除空组

# DeleteGroupTitle
source: Delete Group
zh_cn: 删除分组

# DeleteImageButton.Content
source: Delete
zh_cn: 删除图片

# DeleteImageSuccess
source: Successful deletion of {count} pictures
zh_cn: 成功删除{count}张图片

# GroupRenameSuccess
source: Group name has been modified.
zh_cn: 组名已修改

# ManagerGroupTitle.Text
source: Group Manager
zh_cn: 分组管理

# MoveImage
source: Transfer
zh_cn: 转移图片

# MoveImageButton.Content
source: Transfer
zh_cn: 转移图片

# MoveImageSuccess
source: Image transfer successful
zh_cn: 图片转移成功

# Sao
source: Cool operation, failed execution
zh_cn: 操作太骚，执行失败

# Deleting
source: Just a moment, please. It's being deleted.
zh_cn: 正在删除，请稍候...

# GroupNameBlock.Text
source: Group Name
zh_cn: 组名

# OnlyOneGroup
source: There's only one group left. It can't be deleted any more. Your majesty!
zh_cn: 就剩一个组了，不能再删了啊！陛下！

# SettingTitle.Text
source: Options
zh_cn: 设置选项

# AuthKeyTitle.Text
source: AuthKey
zh_cn: 授权码

# AuthorizeChangeSuccess
source: Successful modification of AuthKey
zh_cn: 授权码修改成功

# AuthorizeChangeTip
source: You have changed the AuthKey. Do you apply the change to the previously uploaded image?
zh_cn: 您已更改了授权码，是否将该改动应用于之前上传的图片中？

# AuthorizeChangeTitle
source: Change AuthKey
zh_cn: 更改授权码

source: No
zh_cn: 否

# RPBlock.Text
source: R.P.
zh_cn: 分辨率

source: Yes
zh_cn: 是

# AddPrefixTitle.Text
source: Bulk Addition of Picture Prefixes
zh_cn: 批量添加图片前缀

# AddPrefixTipContent
source: Are you sure that the prefix '{prefix}' will be added to the {count} picture in the {group} group?
zh_cn: 即将为{group}分组内的{count}张图片添加 ‘{prefix}’ 前缀，是否确认？

# AddPrefixTipTitle
source: Add Prefix
zh_cn: 添加图片前缀

# CopiedImg
source: Replicated IMG Tags
zh_cn: 已复制IMG标签

# CopiedLink
source: URL has been copied.
zh_cn: 已复制URL

# CopiedMd
source: Copied Markdown link
zh_cn: 已复制Markdown链接

# DeleteImageTipContent
source: Are you sure you want to delete this picture? After deletion, all relevant links will fail
zh_cn: 您确定要删除这张图片吗？删除后，所有相关链接都将失效

# DeleteImageTipTitle
source: Delete Image
zh_cn: 删除图片

# FileNameChangeSuccess
source: Successful file name modification!
zh_cn: 文件名修改成功！

# FileNameErrorExtends
source: File name format error, not providing the correct extension
zh_cn: 文件名格式错误，未提供正确的扩展名

# IsFirstImage
source: This is the first picture!
zh_cn: 这已经是第一张啦！

# IsLastImage
source: This is the last picture!
zh_cn: 这已经是最后一张啦！

# NoImageTip
source: There are no pictures in this group.
zh_cn: 该分组内没有图片哟~

# PrefixEmpty
source: The prefix cannot be empty
zh_cn: 前缀不能为空

# PrefixNotAllow
source: The prefix contains illegal characters
zh_cn: 前缀中包含非法字符

# UseGuideButton.Content
source: Software documentation (zh-CN)
zh_cn: 软件说明

# WaitToChange
source: Please wait for the software to complete the change...
zh_cn: 请等待软件完成更改...

# OpenSourceButton
source: Open Source Link
zh_cn: 开源地址

# UseInfoButton
source: How to use?
zh_cn: 软件说明
